
choice_language = 'Hello!\n' \
                'choose a language\n\n' \
                'Привет!!\n' \
                'Выбери язык'

start_txt = '*текст нажатия кнопки старт для существующего юзера*'


def start_ref_txt(name=None):
    txt = f'Пользователь /{name} теперь является Вашим рефералом'
    return txt


end_reg_ref_txt = '*Текст приветствия, когда юзер регнулся через рефку*\n' \
          'Валюту и язык можно изменить в настройкаъ'

choice_currency_txt = 'Отлично!\n' \
                      'С какой валютой работаем?'

end_reg_txt = 'Поздравляю!\n' \
              'Регистрация окончена, язык и валюту можно изменить в настройках\n' \
              '*какой-то еще текст*'


